import { CityMap } from './types';

export const CITIES: CityMap = {
    "Москва": { lat: 55.75, lon: 37.61 },
    "Истра": { lat: 55.91, lon: 36.85 },
    "Кубинка": { lat: 55.59, lon: 36.72 },
    "Можайск": { lat: 55.50, lon: 36.03 },
    "Волоколамск": { lat: 56.04, lon: 35.96 },
    "Солнечногорск": { lat: 56.18, lon: 36.98 },
    "Завидово": { lat: 56.52, lon: 36.52 },
    "Дубна": { lat: 56.73, lon: 37.16 },
    "Яхрома": { lat: 56.29, lon: 37.48 },
    "Сергиев Посад": { lat: 56.30, lon: 38.13 },
    "Александров": { lat: 56.39, lon: 38.71 },
    "Павловский Посад": { lat: 55.78, lon: 38.65 },
    "Воскресенск": { lat: 55.32, lon: 38.68 },
    "Коломна": { lat: 55.08, lon: 38.78 },
    "Ступино": { lat: 54.89, lon: 38.08 },
    "Серпухов": { lat: 54.91, lon: 37.41 },
    "Калуга": { lat: 54.51, lon: 36.26 },
    "Обнинск": { lat: 55.11, lon: 36.61 },
    "Верея": { lat: 55.34, lon: 36.18 },
    "Жуковский": { lat: 55.60, lon: 38.12 },
    "Рязань": { lat: 54.62, lon: 39.73 },
    "Одинцово": { lat: 55.67, lon: 37.28 },
    "Зеленоград": { lat: 55.99, lon: 37.21 },
    "Подольск": { lat: 55.43, lon: 37.55 },
    "Тула": { lat: 54.19, lon: 37.61 }
};

export const API_URL = "https://api.open-meteo.com/v1/forecast";